app/controllers/articles_controller.rb

UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2020-07-31 17:03:32.605741"], ["id", 1]]
---
  def update
    set_article
    @article.update(article_params)

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_article
    @article = Article.find_by_id(params[:id])